---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceServerExtensions
source: html/d0ee8e83-089d-1703-5f0a-ae18ae8ede5e.htm
---
# ExternalResourceServerExtensions Methods

Gets the specific methods supported by external resource CAD Links.